aehoppe/E70N19_Dev_Board/atsame70n19/include/component/gmac.h
/* -------- GMAC_ST2CW014 : (GMAC Offset: 0x770) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 14) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                               */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_ST2CW014_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_ST2CW014_OFFSET                (0x770)                                       /**<  (GMAC_ST2CW014) Screening Type 2 Compare Word 0 Register (index = 14)  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define GMAC_ST2CW014_MASKVAL_Pos           0                                              /**< (GMAC_ST2CW014) Mask Value Position */
#define GMAC_ST2CW014_MASKVAL_Msk           (0xFFFFU << GMAC_ST2CW014_MASKVAL_Pos)         /**< (GMAC_ST2CW014) Mask Value Mask */
#define GMAC_ST2CW014_MASKVAL(value)        (GMAC_ST2CW014_MASKVAL_Msk & ((value) << GMAC_ST2CW014_MASKVAL_Pos))
#define GMAC_ST2CW014_COMPVAL_Pos           16                                             /**< (GMAC_ST2CW014) Compare Value Position */
#define GMAC_ST2CW014_COMPVAL_Msk           (0xFFFFU << GMAC_ST2CW014_COMPVAL_Pos)         /**< (GMAC_ST2CW014) Compare Value Mask */
#define GMAC_ST2CW014_COMPVAL(value)        (GMAC_ST2CW014_COMPVAL_Msk & ((value) << GMAC_ST2CW014_COMPVAL_Pos))
#define GMAC_ST2CW014_Msk                   (0xFFFFFFFFU)                                  /**< (GMAC_ST2CW014) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- GMAC_ST2CW114 : (GMAC Offset: 0x774) (R/W 32) Screening Type 2 Compare Word 1 Register (index = 14) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OFFSVAL:7;                 /**< bit:   0..6  Offset Value in Bytes                    */
    uint32_t OFFSSTRT:2;                /**< bit:   7..8  Ethernet Frame Offset Start              */
    uint32_t :23;                       /**< bit:  9..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_ST2CW114_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_ST2CW114_OFFSET                (0x774)                                       /**<  (GMAC_ST2CW114) Screening Type 2 Compare Word 1 Register (index = 14)  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define GMAC_ST2CW114_OFFSVAL_Pos           0                                              /**< (GMAC_ST2CW114) Offset Value in Bytes Position */
#define GMAC_ST2CW114_OFFSVAL_Msk           (0x7FU << GMAC_ST2CW114_OFFSVAL_Pos)           /**< (GMAC_ST2CW114) Offset Value in Bytes Mask */
#define GMAC_ST2CW114_OFFSVAL(value)        (GMAC_ST2CW114_OFFSVAL_Msk & ((value) << GMAC_ST2CW114_OFFSVAL_Pos))
#define GMAC_ST2CW114_OFFSSTRT_Pos          7                                              /**< (GMAC_ST2CW114) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW114_OFFSSTRT_Msk          (0x3U << GMAC_ST2CW114_OFFSSTRT_Pos)           /**< (GMAC_ST2CW114) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW114_OFFSSTRT(value)       (GMAC_ST2CW114_OFFSSTRT_Msk & ((value) << GMAC_ST2CW114_OFFSSTRT_Pos))
#define   GMAC_ST2CW114_OFFSSTRT_FRAMESTART_Val (0x0U)                                         /**< (GMAC_ST2CW114) Offset from the start of the frame  */
#define   GMAC_ST2CW114_OFFSSTRT_ETHERTYPE_Val (0x1U)                                         /**< (GMAC_ST2CW114) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW114_OFFSSTRT_IP_Val     (0x2U)                                         /**< (GMAC_ST2CW114) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW114_OFFSSTRT_TCP_UDP_Val (0x3U)                                         /**< (GMAC_ST2CW114) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW114_OFFSSTRT_FRAMESTART   (GMAC_ST2CW114_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW114_OFFSSTRT_Pos)  /**< (GMAC_ST2CW114) Offset from the start of the frame Position  */
#define GMAC_ST2CW114_OFFSSTRT_ETHERTYPE    (GMAC_ST2CW114_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW114_OFFSSTRT_Pos)  /**< (GMAC_ST2CW114) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW114_OFFSSTRT_IP           (GMAC_ST2CW114_OFFSSTRT_IP_Val << GMAC_ST2CW114_OFFSSTRT_Pos)  /**< (GMAC_ST2CW114) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW114_OFFSSTRT_TCP_UDP      (GMAC_ST2CW114_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW114_OFFSSTRT_Pos)  /**< (GMAC_ST2CW114) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW114_MASK                  (0x1FFU)                                       /**< \deprecated (GMAC_ST2CW114) Register MASK  (Use GMAC_ST2CW114_Msk instead)  */
#define GMAC_ST2CW114_Msk                   (0x1FFU)                                       /**< (GMAC_ST2CW114) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- GMAC_ST2CW015 : (GMAC Offset: 0x778) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 15) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                               */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_ST2CW015_Type;
